;***************************************************************************************
;  FILE:   XComDownloadableContentInfo_WOTCGremlinTargetProtocol LOCALIZASTIONS                                    
;           
;	Created by	RustyDios
;	Created		13/09/19	06:30
;	Last Update	20/05/20	23:15
;
;	A version of Holotargetting for crits/aim given by gremlin, granted for free with Scanning Protocol
;
;****************************************************************************************

;New Loco txt for new ability
[GremlinTargetProtocol X2AbilityTemplate]
LocFriendlyName="Target Protocol"
LocHelpText="Send the <Ability:SECONDARYWEAPONNAME/> out to mark a target. Depending on Shen's settings this may have additional effects."
LocLongDescription="Send the <Ability:SECONDARYWEAPONNAME/> out to mark a target. Depending on Shen's settings this may have additional effects. These effects could include Combat Protocol damage, double damage to Robotics, or stopping an certain enemy from splitting."
LocPromotionPopupText="Send the <Ability:SECONDARYWEAPONNAME/> out to mark a target. Depending on Shen's settings this may have additional effects.\n<Bullet>These effects could include Combat Protocol, double damage to Robotics, or stopping an certain enemy from splitting.<br/><Bullet>Who knows what settings Shen has been tinkering with ?<br/>"
LocFlyOverText="Protocol Complete"
LocMissMessage="Target Protocol is active from a <Ability:SECONDARYWEAPONNAME/>. This enemy is suffering the effects."
LocFriendlyNameWhenConcealed="Target Protocol (Concealed)"

;Adjust Loco txt for granting ability, default is set to be Scanning Protocal
[ScanningProtocol X2AbilityTemplate]
;LocFriendlyName="Scanning Protocol"
;LocLongDescription="The <Ability:SECONDARYWEAPONNAME/> can trigger an instant scan of the area, increasing the <Ability:ClassName/>'s sight radius substantially for one turn, and revealing any hidden or disguised enemies in view."
;LocHelpText="Trigger a <Ability:SECONDARYWEAPONNAME/> scan of the area, increasing the your sight radius substantially for one turn, and revealing any hidden or disguised enemies in view."
;LocFlyOverText="Scanning Protocol"
-LocPromotionPopupText="<Bullet/> Scanning Protocol has one charge per mission.<br/><Bullet/> In addition to hidden and disguised enemies, enemies blocked from line of sight by walls or obstructions will also be revealed by Scanning Protocol.<br/>"
+LocPromotionPopupText="<Bullet/> Scanning Protocol has one charge per mission.<br/><Bullet/>In addition to hidden and disguised enemies, enemies blocked from line of sight by walls or obstructions will also be revealed by Scanning Protocol.<br/><Bullet/>Charges may increase with tech level of equipped <Ability:SECONDARYWEAPONNAME/>.<br/><Bullet/>The <Ability:SECONDARYWEAPONNAME/> will also be able to perform a detailed scan on enemies targetted by Combat Protocol. Target Protocol offers a Holo-Targeting style bonus that gives squadmates an increased chance to crit.<br/><Bullet/>The effect increases with tech level of equipped <Ability:SECONDARYWEAPONNAME/>.<br/>"
